{
	"1": [
		"0Привет. Я уже вернулся в Столицу и рассказал о том, что ты узнал. В Столице все у нас забеспокоились.",
		"0Мы уже начали по-немногу анализировать твою флешку. Но нам нужна твоя помощь. Мы пишем программу, которая будет сортировать материалы по характеристикам.",
		"0Сможешь написать на языке Lua скрипт, который получает на входе два числа (размеры файлов в байтах) и на выходе говорит, какой файл больше?",
		"1Да без проблем",
		"0Отлично. Тогда лови материалы для тестирования:",
		"0Архив : ARCHIVE.ZIP : [1.9 Гб] - [05.06.5655 08:35:21]"
	],
	"4": [
		"1Ну все, я написал скрипт. Вроде все работает. Лови:",
		"1ФАЙЛ : SCRIPT01.LUA : [2 Кб] - [05.06.5655 12:05:11]",
		"0Отлично. Спасибо за помощь, Норвуд."
	],
	"comp1": "Вам пришло сообщение в BlobTalk. Прочтите его.",
	"comp2": "\tПовстанцам нужна помощь. Вам поручили написать скрипт, с помощью которого будут анализировать данные с флешки Маршала. Для разработки программ на языке программирования Lua на вашем компьютере установлена среда разработки LUAnvil. Она позволяет писать и запускать скрипты. Также вы можете сохранять их и изменять в дальшейшем.\n\n\tЗапустите LUAnvil с помощью команды [i]run luanvil[/i].",
	"comp3": "\tВы запустили среду разработки LUAnvil. Давайте кратко ознакомимся с ней. Начнем сверху: на верхней панели расположены кнопки сохранения, загрузки. Также там есть кнопка запуска скрипта и кнопка ввода данных, которые программа может потом принимать и использовать. Ниже идет поле редактирования кода и ниже него - вывод программы.\n\n\tВаша задача - написать скрипт, который будет принимать на вход два числа и возвращать большее из них. Программы на языке Lua, которые выполняются в LUAnvil должны иметь функцию [i]main()[/i], в которой происходит описание логики программы. Функция в Lua задается так: [i]function <имя функции>(аргументы)[/i]. После этого пишется тело функции, в котором пишутся команды и инструкции, а в самом конце функции пишется [i]end[/i]. Вид пустой функции: [i]\nfunction main()\n\nend[/i].\n\n\tТеперь перейдем к тому, что должно быть в теле функции для решения задачи. Нам нужны две переменные, которые будут хранить два числа, которые они получат из входа. Локальная переменная задается так: [i]local <имя переменной> = <значение>[/i]. Для наших двух переменных можно взять имена a и b, а для получения значений использовать функцию input(), которая возвращает значение ввода. В итоге у нас должно быть:[i]\nlocal a = input()\nlocal b = input()[/i].\n\n\tКогда мы получили две переменные с числами, надо их сравнить и возвратить большее. Для сравнения существует условный оператор if. Его синтаксис такой: [i]\nif <условие> then\n\t<действия если условие верно>\nelse\n\t<действия если условие ложно>\nend[/i]\nНужное условие: [i]a > b[/i]\nЕсли условие верно, то возвращаем переменную a с помощью ключевого слова return:\n[i]return a[/i]\nЕсли условие ложно, возвращаем переменную b:\n[i]return b[/i]\n\n\tТеперь надо нажать на кнопку [i]Запустить[/i]. Программа заработает и автоматически проведутся тесты ее работы. Если в коде будут ошибки, LUAnvil сообщит об этом. Если цель задания не изменится, то программа проводит вычисления некорректно.",
	"comp4": "Примите поздравления, все тесты успешно пройдены! Теперь зайдите в чат с Миширану в BlobTalk чтобы отправить ему скрипт.",
	"comp5": "Выключите компьютер с помощью кнопки или команды shutdown."
}
