{
	"4": [
		"0Окей, смотри: запускаешь программу Netwalker, подключаешься к серверу 192.168.0.5, отправляешь пакет с маршрутом login и паролем b2)w00Z*FX^yZ",
		"0Когда авторизуешься, отправь пакет по маршруту user-location с именем пользователя eddy75im. Отправь мне координаты, которые пришлет тебе сервер"
	],
	"9": "1Координаты того типа: 51.58913N, -0.17498W",
	"comp_task1": "[b]Запустите мессенджер BlobTalk[/b]\n\nВремя знакомиться с компьютером! Общение с компьютером происходит посредством команд, вводимых в строку ввода, расположенную снизу. Команда для запуска программ называется [i]run[/i]. Введите [i]run blobtalk[/i] чтобы запустить мессенджер. Прочитайте сообщения, что прислал Миширану.",
	"comp_task2": "[b]Запустите сетевую программу Netwalker[/b]\n\nЗакройте мессенджер и запустите программу netwalker с помощью команды run.",
	"comp_task3": "[b]Подключитесь к сетевому ресурсу и узнайте координаты[/b]\n\nДобро пожаловать в сеть! В сети существуют разные виды компьютеров. Основные два типа: клиент и сервер. Клиент посылает запрос серверу, а сервер отправляет ответ. Запросы состоят из пакетов данных, содержащих информацию.\n\nДля начала вам нужно подключиться к серверу, адрес которого вам отправил Миширану. Воспользуйтесь командой connect и подключитесь к серверу 192.168.0.5\n\nКогда подключение прошло, вам необходимо отправить серверу запрос на авторизацию. Запрос формируется из пакетов данных. В пакете данных обычно должен быть указан метод сетевого протокола, а после него маршрут, после которого могут быть дополнительные данные. Пример пакета: [i]get someroute somedata[/i]. Здесь get - это метод, который говорит серверу что мы хотим получить данные, someroute - маршрут, somedata - дополнительные данные. Чтобы отправить этому серверу запрос на авторизацию, необходимо добавить в стек новый пакет с помощью команды add-packet в которой указать метод post, который значит что сервер должен принять наши данные, маршрут login и дополнительные данные [i]b2)w00Z*FX^yZ[/i] - пароль для авторизации. Когда пакет добавлен, отправьте запрос командой send-request. Если все прошло удачно, вам придет ответный код 200 \"Все отлично\".\n\nТеперь вы можете отправить серверу запрос координат пользователя. Добавьте пакет с методом get, маршрутом user-location и дополнительными данными eddy75im - юзернейм нужного пользователя. Если все прошло успешно, сервер ответит координатами.",
	"comp_task4": "[b]Зайдите в чат с Миширану в BlobTalk[/b]\n\nОтключитесь от сервера и закройте Netwalker с помощью команды exit. Запустите BlobTalk и зайдите в чат с Миширану, чтобы отправить сообщение.",
	"comp_task5": "[b]Выключите компьютер[/b]\n\nВыключите компьютер при помощи кнопки Shutdown или команды shutdown"
}
